#include <iostream> 
using namespace std; 

int main(){ 
 	float a[2][2];
    cout<<"Введите матрицу второго порядка.\n";  
    for (int i = 0; i < 2 ;i++){  	 	 
 	 	for(int j = 0; j < 2; j++){
            cout << "Строка №" << i + 1 << ", столбец №" << j + 1 << ": ";
            cin >> a[i][j];
        } 
	}
    cout << "Сумма элементов 1 столбца = " << a[0][0] + a[1][0] << endl;
    cout << "Сумма элементов 2 столбца = " << a[1][0] + a[1][1] << endl;
    cout << "Сумма элементов 1 строки = " << a[0][0] + a[0][1] << endl;
    cout << "Сумма элементов 2 строки = " << a[1][0] + a[1][1] << endl;
 	return 0; 
} 
